Revit 2024 API
SpotDimensionType Class
 A type element containing the properties of a spot elevation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class SpotDimensionType : DimensionType
Visual Basic
Public Class SpotDimensionType _
	Inherits DimensionType
Visual C++
public ref class SpotDimensionType : public DimensionType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.DimensionType
 Autodesk.Revit.DB.SpotDimensionType
See Also
SpotDimensionType Members
Autodesk.Revit.DB Namespace